{
   "class_name": "Functional",
   "config": {
      "name": "FASNet",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  80,
                  80,
                  3
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "inputs"
            },
            "name": "inputs",
            "inbound_nodes": []
         },
         {
            "class_name": "Functional",
            "config": {
               "name": "conv1",
               "layers": [
                  {
                     "class_name": "InputLayer",
                     "config": {
                        "batch_input_shape": [
                           null,
                           80,
                           80,
                           3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "inputs"
                     },
                     "name": "inputs",
                     "inbound_nodes": []
                  },
                  {
                     "class_name": "ZeroPadding2D",
                     "config": {
                        "name": "zero_padding2d_402",
                        "trainable": true,
                        "dtype": "float32",
                        "padding": [
                           [
                              1,
                              1
                           ],
                           [
                              1,
                              1
                           ]
                        ],
                        "data_format": "channels_last"
                     },
                     "name": "zero_padding2d_402",
                     "inbound_nodes": [
                        [
                           [
                              "inputs",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "Conv2D",
                     "config": {
                        "name": "conv2d_810",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                           3,
                           3
                        ],
                        "strides": [
                           2,
                           2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                           1,
                           1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                           "class_name": "VarianceScaling",
                           "config": {
                              "scale": 2.0,
                              "mode": "fan_out",
                              "distribution": "truncated_normal",
                              "seed": 42
                           }
                        },
                        "bias_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                     },
                     "name": "conv2d_810",
                     "inbound_nodes": [
                        [
                           [
                              "zero_padding2d_402",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "BatchNormalization",
                     "config": {
                        "name": "batch_normalization_822",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                           3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "gamma_initializer": {
                           "class_name": "Ones",
                           "config": {}
                        },
                        "moving_mean_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "moving_variance_initializer": {
                           "class_name": "Ones",
                           "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                     },
                     "name": "batch_normalization_822",
                     "inbound_nodes": [
                        [
                           [
                              "conv2d_810",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "PReLU",
                     "config": {
                        "name": "p_re_lu_396",
                        "trainable": true,
                        "dtype": "float32",
                        "alpha_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": [
                           1,
                           2
                        ]
                     },
                     "name": "p_re_lu_396",
                     "inbound_nodes": [
                        [
                           [
                              "batch_normalization_822",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  }
               ],
               "input_layers": [
                  [
                     "inputs",
                     0,
                     0
                  ]
               ],
               "output_layers": [
                  [
                     "p_re_lu_396",
                     0,
                     0
                  ]
               ]
            },
            "name": "conv1",
            "inbound_nodes": [
               [
                  [
                     "inputs",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Functional",
            "config": {
               "name": "conv2",
               "layers": [
                  {
                     "class_name": "InputLayer",
                     "config": {
                        "batch_input_shape": [
                           null,
                           40,
                           40,
                           32
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "inputs"
                     },
                     "name": "inputs",
                     "inbound_nodes": []
                  },
                  {
                     "class_name": "ZeroPadding2D",
                     "config": {
                        "name": "zero_padding2d_403",
                        "trainable": true,
                        "dtype": "float32",
                        "padding": [
                           [
                              1,
                              1
                           ],
                           [
                              1,
                              1
                           ]
                        ],
                        "data_format": "channels_last"
                     },
                     "name": "zero_padding2d_403",
                     "inbound_nodes": [
                        [
                           [
                              "inputs",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "Conv2D",
                     "config": {
                        "name": "conv2d_811",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                           3,
                           3
                        ],
                        "strides": [
                           1,
                           1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                           1,
                           1
                        ],
                        "groups": 32,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                           "class_name": "VarianceScaling",
                           "config": {
                              "scale": 2.0,
                              "mode": "fan_out",
                              "distribution": "truncated_normal",
                              "seed": 42
                           },
                           "shared_object_id": 3
                        },
                        "bias_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                     },
                     "name": "conv2d_811",
                     "inbound_nodes": [
                        [
                           [
                              "zero_padding2d_403",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "BatchNormalization",
                     "config": {
                        "name": "batch_normalization_823",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                           3
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "gamma_initializer": {
                           "class_name": "Ones",
                           "config": {}
                        },
                        "moving_mean_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "moving_variance_initializer": {
                           "class_name": "Ones",
                           "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                     },
                     "name": "batch_normalization_823",
                     "inbound_nodes": [
                        [
                           [
                              "conv2d_811",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "PReLU",
                     "config": {
                        "name": "p_re_lu_397",
                        "trainable": true,
                        "dtype": "float32",
                        "alpha_initializer": {
                           "class_name": "Zeros",
                           "config": {}
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": [
                           1,
                           2
                        ]
                     },
                     "name": "p_re_lu_397",
                     "inbound_nodes": [
                        [
                           [
                              "batch_normalization_823",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  }
               ],
               "input_layers": [
                  [
                     "inputs",
                     0,
                     0
                  ]
               ],
               "output_layers": [
                  [
                     "p_re_lu_397",
                     0,
                     0
                  ]
               ]
            },
            "name": "conv2",
            "inbound_nodes": [
               [
                  [
                     "conv1",
                     1,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Functional",
            "config": {
               "name": "DWconv23",
               "layers": [
                  {
                     "class_name": "InputLayer",
                     "config": {
                        "batch_input_shape": [
                           null,
                           40,
                           40,
                           32
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "inputs"
                     },
                     "name": "inputs",
                     "inbound_nodes": []
                  },
                  {
                     "class_name": "Functional",
                     "config": {
                        "name": "conv1",
                        "layers": [
                           {
                              "class_name": "InputLayer",
                              "config": {
                                 "batch_input_shape": [
                                    null,
                                    40,
                                    40,
                                    32
                                 ],
                                 "dtype": "float32",
                                 "sparse": false,
                                 "ragged": false,
                                 "name": "inputs"
                              },
                              "name": "inputs",
                              "inbound_nodes": []
                           },
                           {
                              "class_name": "ZeroPadding2D",
                              "config": {
                                 "name": "zero_padding2d_404",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "padding": [
                                    [
                                       0,
                                       0
                                    ],
                                    [
                                       0,
                                       0
                                    ]
                                 ],
                                 "data_format": "channels_last"
                              },
                              "name": "zero_padding2d_404",
                              "inbound_nodes": [
                                 [
                                    [
                                       "inputs",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "Conv2D",
                              "config": {
                                 "name": "conv2d_812",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "filters": 103,
                                 "kernel_size": [
                                    1,
                                    1
                                 ],
                                 "strides": [
                                    1,
                                    1
                                 ],
                                 "padding": "valid",
                                 "data_format": "channels_last",
                                 "dilation_rate": [
                                    1,
                                    1
                                 ],
                                 "groups": 1,
                                 "activation": "linear",
                                 "use_bias": false,
                                 "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                       "scale": 2.0,
                                       "mode": "fan_out",
                                       "distribution": "truncated_normal",
                                       "seed": 42
                                    },
                                    "shared_object_id": 3
                                 },
                                 "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "kernel_regularizer": null,
                                 "bias_regularizer": null,
                                 "activity_regularizer": null,
                                 "kernel_constraint": null,
                                 "bias_constraint": null
                              },
                              "name": "conv2d_812",
                              "inbound_nodes": [
                                 [
                                    [
                                       "zero_padding2d_404",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "BatchNormalization",
                              "config": {
                                 "name": "batch_normalization_824",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "axis": [
                                    3
                                 ],
                                 "momentum": 0.99,
                                 "epsilon": 0.001,
                                 "center": true,
                                 "scale": true,
                                 "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "beta_regularizer": null,
                                 "gamma_regularizer": null,
                                 "beta_constraint": null,
                                 "gamma_constraint": null
                              },
                              "name": "batch_normalization_824",
                              "inbound_nodes": [
                                 [
                                    [
                                       "conv2d_812",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "PReLU",
                              "config": {
                                 "name": "p_re_lu_398",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "alpha_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "alpha_regularizer": null,
                                 "alpha_constraint": null,
                                 "shared_axes": [
                                    1,
                                    2
                                 ]
                              },
                              "name": "p_re_lu_398",
                              "inbound_nodes": [
                                 [
                                    [
                                       "batch_normalization_824",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           }
                        ],
                        "input_layers": [
                           [
                              "inputs",
                              0,
                              0
                           ]
                        ],
                        "output_layers": [
                           [
                              "p_re_lu_398",
                              0,
                              0
                           ]
                        ]
                     },
                     "name": "conv1",
                     "inbound_nodes": [
                        [
                           [
                              "inputs",
                              0,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "Functional",
                     "config": {
                        "name": "conv2",
                        "layers": [
                           {
                              "class_name": "InputLayer",
                              "config": {
                                 "batch_input_shape": [
                                    null,
                                    40,
                                    40,
                                    103
                                 ],
                                 "dtype": "float32",
                                 "sparse": false,
                                 "ragged": false,
                                 "name": "inputs"
                              },
                              "name": "inputs",
                              "inbound_nodes": []
                           },
                           {
                              "class_name": "ZeroPadding2D",
                              "config": {
                                 "name": "zero_padding2d_405",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "padding": [
                                    [
                                       1,
                                       1
                                    ],
                                    [
                                       1,
                                       1
                                    ]
                                 ],
                                 "data_format": "channels_last"
                              },
                              "name": "zero_padding2d_405",
                              "inbound_nodes": [
                                 [
                                    [
                                       "inputs",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "Conv2D",
                              "config": {
                                 "name": "conv2d_813",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "filters": 103,
                                 "kernel_size": [
                                    3,
                                    3
                                 ],
                                 "strides": [
                                    2,
                                    2
                                 ],
                                 "padding": "valid",
                                 "data_format": "channels_last",
                                 "dilation_rate": [
                                    1,
                                    1
                                 ],
                                 "groups": 103,
                                 "activation": "linear",
                                 "use_bias": false,
                                 "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                       "scale": 2.0,
                                       "mode": "fan_out",
                                       "distribution": "truncated_normal",
                                       "seed": 42
                                    },
                                    "shared_object_id": 3
                                 },
                                 "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "kernel_regularizer": null,
                                 "bias_regularizer": null,
                                 "activity_regularizer": null,
                                 "kernel_constraint": null,
                                 "bias_constraint": null
                              },
                              "name": "conv2d_813",
                              "inbound_nodes": [
                                 [
                                    [
                                       "zero_padding2d_405",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "BatchNormalization",
                              "config": {
                                 "name": "batch_normalization_825",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "axis": [
                                    3
                                 ],
                                 "momentum": 0.99,
                                 "epsilon": 0.001,
                                 "center": true,
                                 "scale": true,
                                 "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "beta_regularizer": null,
                                 "gamma_regularizer": null,
                                 "beta_constraint": null,
                                 "gamma_constraint": null
                              },
                              "name": "batch_normalization_825",
                              "inbound_nodes": [
                                 [
                                    [
                                       "conv2d_813",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "PReLU",
                              "config": {
                                 "name": "p_re_lu_399",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "alpha_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "alpha_regularizer": null,
                                 "alpha_constraint": null,
                                 "shared_axes": [
                                    1,
                                    2
                                 ]
                              },
                              "name": "p_re_lu_399",
                              "inbound_nodes": [
                                 [
                                    [
                                       "batch_normalization_825",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           }
                        ],
                        "input_layers": [
                           [
                              "inputs",
                              0,
                              0
                           ]
                        ],
                        "output_layers": [
                           [
                              "p_re_lu_399",
                              0,
                              0
                           ]
                        ]
                     },
                     "name": "conv2",
                     "inbound_nodes": [
                        [
                           [
                              "conv1",
                              1,
                              0,
                              {}
                           ]
                        ]
                     ]
                  },
                  {
                     "class_name": "Functional",
                     "config": {
                        "name": "Linear_conv_block",
                        "layers": [
                           {
                              "class_name": "InputLayer",
                              "config": {
                                 "batch_input_shape": [
                                    null,
                                    20,
                                    20,
                                    103
                                 ],
                                 "dtype": "float32",
                                 "sparse": false,
                                 "ragged": false,
                                 "name": "inputs"
                              },
                              "name": "inputs",
                              "inbound_nodes": []
                           },
                           {
                              "class_name": "Conv2D",
                              "config": {
                                 "name": "conv2d_814",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "filters": 64,
                                 "kernel_size": [
                                    1,
                                    1
                                 ],
                                 "strides": [
                                    1,
                                    1
                                 ],
                                 "padding": "valid",
                                 "data_format": "channels_last",
                                 "dilation_rate": [
                                    1,
                                    1
                                 ],
                                 "groups": 1,
                                 "activation": "linear",
                                 "use_bias": false,
                                 "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                       "scale": 2.0,
                                       "mode": "fan_out",
                                       "distribution": "truncated_normal",
                                       "seed": 42
                                    },
                                    "shared_object_id": 3
                                 },
                                 "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "kernel_regularizer": null,
                                 "bias_regularizer": null,
                                 "activity_regularizer": null,
                                 "kernel_constraint": null,
                                 "bias_constraint": null
                              },
                              "name": "conv2d_814",
                              "inbound_nodes": [
                                 [
                                    [
                                       "inputs",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           },
                           {
                              "class_name": "BatchNormalization",
                              "config": {
                                 "name": "batch_normalization_826",
                                 "trainable": true,
                                 "dtype": "float32",
                                 "axis": [
                                    3
                                 ],
                                 "momentum": 0.99,
                                 "epsilon": 0.001,
                                 "center": true,
                                 "scale": true,
                                 "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                 },
                                 "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                 },
                                 "beta_regularizer": null,
                                 "gamma_regularizer": null,
                                 "beta_constraint": null,
                                 "gamma_constraint": null
                              },
                              "name": "batch_normalization_826",
                              "inbound_nodes": [
                                 [
                                    [
                                       "conv2d_814",
                                       0,
                                       0,
                                       {}
                                    ]
                                 ]
                              ]
                           }
                        ],
                        "input_layers": [
                           [
                              "inputs",
                              0,
                              0
                           ]
                        ],
                        "output_layers": [
                           [
                              "batch_normalization_826",
                              0,
                              0
                           ]
                        ]
                     },
                     "name": "Linear_conv_block",
                     "inbound_nodes": [
                        [
                           [
                              "conv2",
                              1,
                              0,
                              {}
                           ]
                        ]
                     ]
                  }
               ],
               "input_layers": [
                  [
                     "inputs",
                     0,
                     0
                  ]
               ],
               "output_layers": [
                  [
                     "Linear_conv_block",
                     1,
                     0
                  ]
               ]
            },
            "name": "DWconv23",
            "inbound_nodes": [
               [
                  [
                     "conv2",
                     1,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Functional",
            "config": {
               "name": "ResidualSE3",
               "layers": [
                  {
                     "class_name": "InputLayer",
                     "config": {
                        "batch_input_shape": [
                           null,
                           20,
                           20,
                           64
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "inputs"
                     },
                     "name": "inputs",
                     "inbound_nodes": []
                  },
                  {
                     "class_name": "Functional",
                     "config": {
                        "name": "DepthWiseSE_1",
                        "layers": [
                           {
                              "class_name": "InputLayer",
                              "config": {
                                 "batch_input_shape": [
                                    null,
                                    20,
                                    20,
                                    64
                                 ],
                                 "dtype": "float32",
                                 "sparse": false,
                                 "ragged": false,
                                 "name": "inputs"
                              },
                              "name": "inputs",
                              "inbound_nodes": []
                           },
                           {
                              "class_name": "Functional",
                              "config": {
                                 "name": "conv1",
                                 "layers": [
                                    {
                                       "class_name": "InputLayer",
                                       "config": {
                                          "batch_input_shape": [
                                             null,
                                             20,
                                             20,
                                             64
                                          ],
                                          "dtype": "float32",
                                          "sparse": false,
                                          "ragged": false,
                                          "name": "inputs"
                                       },
                                       "name": "inputs",
                                       "inbound_nodes": []
                                    },
                                    {
                                       "class_name": "ZeroPadding2D",
                                       "config": {
                                          "name": "zero_padding2d_406",
                                          "trainable": true,
                                          "dtype": "float32",
                                          "padding": [
                                             [
                                                0,
                                                0
                                             ],
                                             [
                                                0,
                                                0
                                             ]
                                          ],
                                          "data_format": "channels_last"
                                       },
                                       "name": "zero_padding2d_406",
                                       "inbound_nodes": [
                                          [
                                             [
                                                "inputs",
                                                0,
                                                0,
                                                {}
                                             ]
                                          ]
                                       ]
                                    },
                                    {
                                       "class_name": "Conv2D",
                                       "config": {
                                          "name": "conv2d_815",
                                          "trainable": true,
                                          "dtype": "float32",
                                          "filters": 13,
                                          "kernel_size": [
                                             1,
                                             1
                                          ],
                                          "strides": [
                                             1,
                                             1
                                          ],
                                          "padding": "valid",
                                          "data_format": "channels_last",
                                          "dilation_rate": [
                                             1,
                                             1
                                          ],
                                          "groups": 1,
                                          "activation": "linear",
                                          "use_bias": false,
                                          "kernel_initializer": {
                                             "class_name": "VarianceScaling",
                                             "config": {
                                                "scale": 2.0,
                                                "mode": "fan_out",
                                                "distribution": "truncated_normal",
                                                "seed": 42
                                             },
                                             "shared_object_id": 3
                                          },
                                          "bias_initializer": {
                                             "class_name": "Zeros",
                                             "config": {}
                                          },
                                          "kernel_regularizer": null,
                                          "bias_regularizer": null,
                                          "activity_regularizer": null,
                                          "kernel_constraint": null,
                                          "bias_constraint": null
